Revit 2027 API
BoundingBoxXYZ Constructor
Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxXYZ()
Public Sub New
public:
BoundingBoxXYZ()
new : unit -> BoundingBoxXYZ
See Also
Reference
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace